"""Решение квадратного уравнения"""


def kv_ur(a, b, c):
    """Решение квадратного уравнения"""
    d = b**2 - 4 * a * c

    if d > 0:
        x1 = (-b + d**0.5) / (2 * a)

        x2 = (-b - d**0.5) / (2 * a)

        return "Дискриминант больше нуля, два корня", d, x1, x2

    if d == 0:
        x = (-b) / (2*a)
        return "Дискриминант равен нулю, один корень", d, x

    return "Дискриминант меньше нуля, нет корней", d


def at_zero():
    """Вывод сообщений при переменных равных 0"""
    return "функция линейная", "Функция совпадает с осю Ox"


if __name__ == "__main__":
    a_in = float(input("Введите коэффициент а:"))
    b_in = float(input("Введите коэффициент b:"))
    c_in = float(input("Введите коэффициент c:"))

    if a_in == 0 and b_in == 0 and c_in == 0:
        print(at_zero())
    else:
        print(kv_ur(a_in, b_in, c_in))
