"""Решение квадратного уравнения"""


def kv_ur(a, b, c):
    """Решение квадратного уравнения"""

    if a == 0 and b != 0 and c != 0:
        x = -c / b
        return "Линейное уравнение", x

    d = b**2 - 4 * a * c
    if d > 0:
        x1 = (-b + d**0.5) / (2 * a)

        x2 = (-b - d**0.5) / (2 * a)

        return "Дискриминант больше нуля, два корня", d, x1, x2

    if d == 0:
        x = (-b) / (2*a)
        return "Дискриминант равен нулю, один корень", d, x

    return "Дискриминант меньше нуля, нет корней", d


if __name__ == "__main__":
    a_in = float(input("Введите коэффициент а:"))
    b_in = float(input("Введите коэффициент b:"))
    c_in = float(input("Введите коэффициент c:"))

    print(kv_ur(a_in, b_in, c_in))
